Revit 2027 API
ExternalService Properties
The ExternalService type exposes the following members.
Properties
Name | Description
Description |  The description for the service
IsSerializable |  Indicates whether executions of the service requires serialization in documents or not.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name |  The name of the service
NumberOfServers |  Indicates the number of servers currently registered with the service.
ServiceId |  The Id of the service
SupportActivation |  Indicates if the service supports activation/deactivation of the servers.
VendorId |  The vendor who provided the service
Top
See Also
Reference
ExternalService Class
Autodesk.Revit.DB.ExternalService Namespace